Autodesk.Revit.DB.Architecture.StairsLanding.SetSketchedLandingBoundaryAndPath(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.CurveLoop,Autodesk.Revit.DB.CurveLoop)
Sets the boundary and path curves of the sketched landing.
Remarks:
This should be run from within an open transaction.
document:
The document that owns the landing.
boundaryCurveLoop:
The closed boundary curves of the landing.
pathCurveLoop:
The path curves of the landing, can be an empty CurveLoop.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The boundaryCurveLoop is not closed.
-or-
The input boundaryCurveLoop contains at least one curve which is not a bound Line or bound Arc
and is not supported for this operation.
-or-
The input pathCurveLoop contains at least one curve which is not a bound Line or bound Arc
and is not supported for this operation.
-or-
Failed to create curve element by the boundaryCurveLoop or pathCurveLoop.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.Architecture.StairsLanding.CreateSketchedLandingWithSlopeData(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.Collections.Generic.IList{Autodesk.Revit.DB.SketchedStairsCurveData},System.Double)
Creates a customized landing between two runs by providing the closed boundary curves of the landing, specifying slope type and height.
Remarks:
The new stairs landing and the document will be regenerated.
This should be run from within an open transaction.
document:
The document that owns the landing.
stairsId:
The stairs that the new sketched landing belongs to.
curveLoop:
The closed boundary curves of the new landing, specifying slope type and height.
baseElevation:
Base elevation of the new stairs run. The elevation has following restriction:
The base elevation is relative to the base elevation of the stairs.The base elevation will be rounded automatically to a multiple of the riser height. The base elevation should be equal to or greater than half of the riser height.
Returns:
The new sketched landing.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element stairsId does not exist in the document
-or-
The stairsId is not a valid stairs element.
-or-
The stairs stairsId has no valid landing type.
-or-
The curveLoop is not closed.
The input curveLoop contains at least one curve which is not a bound Line or bound Arc
and is not supported for this operation.
-or-
Failed to create curve element by the curveLoop.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for baseElevation must be no more than 30000 feet in absolute value.
-or-
The baseElevation is less than half of the riser height of the stairs.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The stairs element represented by stairsId is not in an active StairsEditScope.
New components cannot be added to it.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.RegenerationFailedException:
The curveLoop doesn't satisfy restrictions to generate sketched landing.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsLanding.CreateSketchedLanding(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.CurveLoop,System.Double)
Creates a customized landing between two runs by providing the closed boundary curves of the landing.
Remarks:
The new stairs landing and the document will be regenerated.
This should be run from within an open transaction.
document:
The document that owns the landing.
stairsId:
The stairs that the new sketched landing belongs to.
curveLoop:
The closed boundary curves of the new landing.
baseElevation:
Base elevation of the new stairs run. The elevation has following restriction:
The base elevation is relative to the base elevation of the stairs.The base elevation will be rounded automatically to a multiple of the riser height. The base elevation should be equal to or greater than half of the riser height.
Returns:
The new sketched landing.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element stairsId does not exist in the document
-or-
The stairsId is not a valid stairs element.
-or-
The stairs stairsId has no valid landing type.
-or-
The curveLoop is not closed.
-or-
The input curveLoop contains at least one curve which is not a bound Line or bound Arc
and is not supported for this operation.
-or-
Failed to create curve element by the curveLoop.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for baseElevation must be no more than 30000 feet in absolute value.
-or-
The baseElevation is less than half of the riser height of the stairs.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The stairs element represented by stairsId is not in an active StairsEditScope.
New components cannot be added to it.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.RegenerationFailedException:
The curveLoop doesn't satisfy restrictions to generate sketched landing.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsLanding.CanCreateAutomaticLanding(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Checks whether automatic landing(s) can be created between the given two stairs runs and
logically join(s) with the stairs runs.
Remarks:
This only checks whether two stairs runs meet restriction to create automatic landing(s)
without checking the stairs edit scope and document modifiable.
document:
The document that owns the stairs runs.
firstRunId:
The first stairs run.
secondRunId:
The second stairs run.
Returns:
True if automatic landing(s) can be created between the two stairs runs, False otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.Architecture.StairsLanding.CreateAutomaticLanding(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates automatic landing(s) between two stairs runs.
Remarks:
This should be called within open stairs edit scope and transaction.
The new stairs landing(s) and the document will be regenerated.
The landing type of the new stairs landing(s) is determined by stairs type.
document:
The document that owns the stairs runs and new landing(s).
firstRunId:
The first stairs run.
secondRunId:
The second stairs run.
Returns:
The created landing(s) between the two stairs runs.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The firstRunId is not a valid stairs run.
-or-
The secondRunId is not a valid stairs run.
-or-
The stairs runs firstRunId and secondRunId belong to different stairs host.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The stairs element to which the stairs component firstRunId belong is not in an active StairsEditScope.
-or-
Cannot create automatic landing(s) between stairs runs of firstRunId and secondRunId.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.RegenerationFailedException:
Failed to create automatic landing(s) due to document regeneration failures.
Since:
2013